export default {
  data() {
    this.colors = ['#13af7b','#3497e4', '#ee2546','#ffbb00','#7538c7','#ff5100'],
    this.lineSettings = {
      stack: { 用户: ["访问用户", "下单用户"] },
      area: true
    };
    this.ringSettings = {
      roseType: "radius"
    };
    this.histogramSettings = {
      metrics: ["访问用户", "下单用户"],
      dimension: ["日期"]
    };
    this.funnelSettings = {
      dimension: "状态",
      metrics: "数值"
    };
    return {
      peopleNum: 1023,
      money: 6783.5,
      sellNum: 573,
      messageNum: 79,
      speed: 40,
      duration: 4000,
      lineData: {
        columns: ["日期", "访问用户", "下单用户", "下单率"],
        rows: [
          { 日期: "1/1", 访问用户: 1393, 下单用户: 1093, 下单率: 0.32 },
          { 日期: "1/2", 访问用户: 3530, 下单用户: 3230, 下单率: 0.26 },
          { 日期: "1/3", 访问用户: 2923, 下单用户: 2623, 下单率: 0.76 },
          { 日期: "1/4", 访问用户: 1723, 下单用户: 1423, 下单率: 0.49 },
          { 日期: "1/5", 访问用户: 3792, 下单用户: 3492, 下单率: 0.323 },
          { 日期: "1/6", 访问用户: 4593, 下单用户: 4293, 下单率: 0.78 },
          { 日期: "1/7", 访问用户: 5634, 下单用户: 6837, 下单率: 0.78 }
        ]
      },
      ringData: {
        columns: ["日期", "访问用户"],
        rows: [
          { 日期: "1/1", 访问用户: 1393 },
          { 日期: "1/2", 访问用户: 3530 },
          { 日期: "1/3", 访问用户: 2923 },
          { 日期: "1/4", 访问用户: 1723 },
          { 日期: "1/5", 访问用户: 3792 },
          { 日期: "1/6", 访问用户: 4593 }
        ]
      },
      histogramData: {
        columns: ["日期", "访问用户", "下单用户", "下单率"],
        rows: [
          { 日期: "1/1", 访问用户: 1393, 下单用户: 1093, 下单率: 0.32 },
          { 日期: "1/2", 访问用户: 3530, 下单用户: 3230, 下单率: 0.26 },
          { 日期: "1/3", 访问用户: 2923, 下单用户: 2623, 下单率: 0.76 },
          { 日期: "1/4", 访问用户: 1723, 下单用户: 1423, 下单率: 0.49 },
          { 日期: "1/5", 访问用户: 3792, 下单用户: 3492, 下单率: 0.323 },
          { 日期: "1/6", 访问用户: 4593, 下单用户: 4293, 下单率: 0.78 }
        ]
      },
      funnelData: {
        columns: ["状态", "数值"],
        rows: [
          { 状态: "展示", 状态: "展示", 数值: 900 },
          { 状态: "访问", 状态: "访问", 数值: 600 },
          { 状态: "点击", 状态: "点击", 数值: 300 },
          { 状态: "订单", 状态: "订单", 数值: 100 }
        ]
      }
    };
  }
}